"""Chapter6 数据选择"""
import pandas as pd

df4 = pd.read_excel(r"D:\Vickie\practice\test.xlsx",
                    sheet_name="Sheet4", sep=",")
# print(df4["订单编号"])
# print(df4[["订单编号", "客户姓名"]])  # 多个列名用一个list存起来->普通索引
# 传入具体位置获取数据-> 位置索引：iloc()方法
# print(df4.iloc[:, [0, 2]])  # 获取第一列和第三列的数值：逗号之前表示行的位置，只输入一个冒号表示获取所有行；逗号之后表示列的位置，
# 从0开始计数
# 选择连续的几列数据 -> 切片索引
# print(df4.iloc[:, 0:3])  # 获取从第一列到第四列的值
# 6.2 行选择
# 普通索引loc方法
# 位置索引iloc方法
df4.index = ["一", "二", "三", "四", "五", "六"]
# print(df4)
# print(df4.loc["一"])  # 选择一行
# print(df4.loc[["一", "二"]])  # 选择第一行和第二行，多行切记用中括号
# # 使用iloc方法
# print(df4.iloc[0])  # 选择第一行
# print(df4.iloc[[0, 1]])  # 选择第一行和第二行，多行切记用中括号
# # 6.2.2 选择连续的某几行
# print(df4.iloc[0: 2])  # 选择第一行到第三行
# 6.2.3 选择满足条件的行
# 传入条件 -> 布尔索引

df1 = pd.read_excel(r"D:\Vickie\practice\test.xlsx",
                    sheet_name="Sheet1", sep=",")
df1.columns = ["编号", "年龄", "性别", "注册时间", "收入", "家属数"]
df1.index = ["一", "二", "三", "四", "五", "六", "七", "八"]

# print(df1[df1["年龄"] < 40])  # 选择年龄小于40的数据
# print(df1[(df1["年龄"] < 40) & (df1["收入"] < 5000)])  # 选择年龄小于40同时收入小于5000的
# 6.3 行列同时选择
# 6.3.1 普通索引+普通索引loc
# 获取第一行、第三行和第一列、第三列数据
print(df1.loc[["一", "三"], ["年龄", "收入"]])
# 6.3.2 位置索引+位置索引iloc
# 传入行列位置
print(df1.iloc[[0, 1], [0, 2]])  # 行、列索引的位置都是从0开始计数
# 6.3.3 布尔索引+普通索引
print(df1[df1["年龄"] < 40][["年龄", "收入"]])
# 6.3.4 切片索引+切片索引
print(df1)
print(df1.iloc[0:2, 1:2])  # 第一行到第三行和第二列到第三列
# 6.3.5 切片索引+普通索引ix()
print(df1.ix[0:2, ["年龄", "收入"]])







